export enum PERSONAL_CONSTANT{
    // tab页切换
    TAB_INFO,
    TAB_HONOR,
    TAB_FRAME,

	// 成就
    TypeAchieve = 4,
    
	// 胡32倍以上次数
	CondHu32RatioTimes = 6,
	// 任意游戏获胜5次
	CondWinRound = 8,
	// 任意对局15局
	CondGameRound = 10,
	// 胡牌次数
	CondHuTimes = 18,
	// 赢金豆数
	CondWinGold = 19,
	// 自摸次数
	CondOwnDrawTimes = 20,
    // 最多倍数、番型、牌型
	CondRatioFanMajong = 9999,
}

export enum Fan {
  // 以下【32番】
	/**
	 * 十八罗汉：胡牌牌型中有4种杠牌。(不计碰碰胡)
	 * S:12,12,12,12 13,13,13,13 17,17,17,17 19,19,19,19 H:28,28
	 */
	ShiBaLuoHan = 0,

	/**
	 * 大三元：胡牌牌型中有中发白三种刻(杠)牌。
	 * S: H:11,11 12,13,14 41,41,41 42,42,42 43,43,43
	 */
	DaSanYuan,

	/**
	 * 大四喜：胡牌牌型中有东南西北4种刻(杠)牌。(不计碰碰胡)
	 * S: H:11,11 31,31,31 32,32,32 33,33,33 34,34,34
	 */
	DaSiXi,

	/**
	 * 十三幺：有19万，19条，19筒及东南西北中发白各1张，外加以上13张牌中任意1张组成的胡牌。(不计门清)
	 * S: H:1,9,11,19,21,29,31,32,33,34,41,42,43,1
	 */
	ShiSanYao,

	/**
	 * 九宝莲灯：同一花色形成1112345678999，再摸到该种牌任何一张即可胡牌。(不计清一色，门前清)
	 * S: H:11,11,11 12,13,14,15,16,17,18 19,19,19 15
	 */
	JiuBaoLianDeng,

	/**
	 * 清龙七对：清一色+龙七对。(不计清一色、龙七对)
	 * S: H:11,11 11,11 14,14 15,15 16,16 17,17 19,19
	 */
	QingLongQiDui,

	/**
	 * 地胡：闲家摸第1张牌就自摸胡牌。
	 * 天胡：庄家发牌后直接胡牌。
	 */
	TianHu,
	DiHu,

	// 以下【16番】
	/**
	 * 小四喜：胡牌牌型中有东南西北组成的3种刻(杠)牌及1对将牌。
	 * S: H:11,12,13 31,31 32,32,32 33,33,33 34,34,34
	 */
	XiaoSiXi,

	/**
	 * 小三元：胡牌牌型中有中发白组成的2种刻(杠)牌及1对将牌。
	 * S: H:11,11,11 12,13,14 41,41,41 42,42,42 43,43
	 */
	XiaoSanYuan,

	/**
	 * 字一色：由东南西北中发白的4种刻牌(杠)和1对将牌组成的胡牌。(不计碰碰胡)
	 * S: H:31,31,31 32,32,32 33,33,33 41,41,41 42,42
	 */
	ZiYiSe,

	/**
	 * 清七对：清一色七对。（不计清一色、七对）
	 * S: H:11,11 12,12 14,14 15,15 16,16 17,17 19,19
	 */
	QingQiDui,

	// 以下【8番】
	/**
	 * 龙七对：七对牌型中有4张相同牌。
	 * S: H:11,11, 11,11 14,14 18,18 19,19 26,26 27,27
	 */
	LongQiDui,

	/**
	 * 清碰：清一色+碰碰胡。(不计清一色、碰碰胡)
	 * S: H:11,11,11 14,14,14 15,15,15 17,17,17 19,19
	 */
	QingPeng,

	// 以下【4番】
	/**
	 * 七对：由7个对子组成的胡牌。
	 * S: H:11,11 13,13 14,14 18,18 19,19 26,26 27,27
	 */
	QiDui,

	/**
	 * 清一色：由一种花色序数牌组成的胡牌。
	 * S: H:11,11,11 12,13,14 15,15,15 16,16,16 19,19
	 */
	QingYiSe,

	/**
	 * 混碰：混一色+碰碰胡。(不计混一色、碰碰胡)
	 * S: H:11,11,11 13,13,13 17,17,17 31,31,31 34,34
	 */
	HunPeng,

	// 以下【2番】
	/**
	 * 杠上开花：杠牌后补牌正是要胡的牌。
	 */
	GangShangKaiHua,

	/**
	 * 碰碰胡：由4种刻牌(杠)外加1对将牌组成的胡牌。
	 * S: H:12,12,12 13,13,13 18,18,18 23,23,23 28,28
	 */
	PengPengHu,

	/**
	 * 混一色：由一种花色序数牌及字牌组成的胡牌。
	 * S: H:11,11,11 12,13,14 17,18,19 31,31,31 34,34
	 */
	HunYiSe,

	/**
	 * 门前清：胡牌时，没有吃、碰、明杠过。
	 * S: H:12,13,14 14,15,16 17,18,19 21,22,23 28,28
	 */
	MenQianQing,

	/**
	 * 自摸：玩家通过自摸胡牌。
	 */
	ZiMo,

	/**
	 * 杠后炮：玩家杠牌后打出的第1张牌是能胡的牌。
	 */
	GangHouPao,

	/**
	 * 抢杠胡：其他玩家补杠的牌刚好是能胡的牌。
	 */
	QiangGangHu,

	// 以下【1番】
	/**
	 * 平胡：最普通的胡牌牌型。
	 * S: H:12,13,14 14,15,16 17,17,17 21,22,23 28,28
	 */
	PingHu,

	/**
	 * 明杠：其他玩家直接放杠，杠牌后放杠玩家扣3分。
	 * S:14,14,14,14 H:11,11,11 11,12,13 22,22,22 26,26
	 */
	MingGang,

	/**
	 * 暗杠：4张牌都是玩家自己摸到的，杠牌后其他三家都扣2分。
	 */
	AnGang,

	/**
	 * 补杠：碰牌后，第4张牌是自己摸到的，杠牌后其他三家都扣1分。
	 */
	BuGang,

	/**
	 * 金钩钓：胡牌时手牌只剩下一张单吊胡牌，不计碰碰胡。
	 */
	JinGouGou,

	/**
	 * 带幺九：顺子、刻子和将牌都含一或九。
	 */
	DaiYaoJiu,

	/**
	 * 将对：由二、五、八组成的碰碰胡，不计碰碰胡。
	 */
	JiangDui,

	/**
	 * 清金钩钓：由清一色和金钩钓组成的胡牌。
	 */
	QingJinGouGou,

	/**
	 * 清幺九：同一种花色的带幺九，不计带幺九、清一色。
	 */
	QingDaiYaoJiu,

	/**
	 * 清十八罗汉：清一色十八罗汉，不计4杠、金钩钓、碰碰胡。
	 */
	QingShiBaLuoHan,

	/**
	 * 海底捞月：牌面最后一张牌并且自摸胡牌。
	 */
	HaiDiLaoYue,

	/**
	 * 海底炮：牌面最后一张牌打出并且给其他人点炮胡牌。
	 */
	HaiDiPao,
}